---
kind: method
id: M:Autodesk.Revit.DB.ElementId.#ctor(System.Int64)
source: html/0b12e329-90c1-4610-3bae-83df3236266c.htm
---
# Autodesk.Revit.DB.ElementId.#ctor Method

Create an ElementId handle with the given 64-bit integer id.

## Syntax (C#)
```csharp
public ElementId(
	long id
)
```

## Parameters
- **id** (`System.Int64`) - The id.